driver-tests/bpelse/eventHandlers/onAlarmWithFHJBI/test/ExitInFH/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:faul="http://xml.netbeans.org/schema/FaultSchema">
  <soapenv:Body>
    <faul:msgElem>
      <faul:id>2</faul:id>
      <faul:name>Exit Condition</faul:name>
    </faul:msgElem>
  </soapenv:Body>
</soapenv:Envelope>